zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_TDET.h
/*
** ###################################################################
**     Processors:          MCXA165VLH
**                          MCXA165VLL
**                          MCXA165VLQ
**                          MCXA165VPN
**                          MCXA166VLH
**                          MCXA166VLL
**                          MCXA166VLQ
**                          MCXA166VPN
**                          MCXA175VLH
**                          MCXA175VLL
**                          MCXA175VLQ
**                          MCXA175VPN
**                          MCXA176VLH
**                          MCXA176VLL
**                          MCXA176VLQ
**                          MCXA176VPN
**                          MCXA275VLH
**                          MCXA275VLL
**                          MCXA275VLQ
**                          MCXA275VPN
**                          MCXA276VLH
**                          MCXA276VLL
**                          MCXA276VLQ
**                          MCXA276VPN
**
**     Version:             rev. 1.0, 2024-03-26
**     Build:               b241120
**
**     Abstract:
**         CMSIS Peripheral Access Layer for TDET
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**
** ###################################################################
*/

/*!
 * @file TDET.h
 * @version 1.0
 * @date 2024-03-26
 * @brief CMSIS Peripheral Access Layer for TDET
 *
 * CMSIS Peripheral Access Layer for TDET
 */

#if !defined(TDET_H_)
#define TDET_H_                                  /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA165VLH) || defined(CPU_MCXA165VLL) || defined(CPU_MCXA165VLQ) || defined(CPU_MCXA165VPN))
#include "MCXA165_COMMON.h"
#elif (defined(CPU_MCXA166VLH) || defined(CPU_MCXA166VLL) || defined(CPU_MCXA166VLQ) || defined(CPU_MCXA166VPN))
#include "MCXA166_COMMON.h"
#elif (defined(CPU_MCXA175VLH) || defined(CPU_MCXA175VLL) || defined(CPU_MCXA175VLQ) || defined(CPU_MCXA175VPN))
#include "MCXA175_COMMON.h"
#elif (defined(CPU_MCXA176VLH) || defined(CPU_MCXA176VLL) || defined(CPU_MCXA176VLQ) || defined(CPU_MCXA176VPN))
#include "MCXA176_COMMON.h"
#elif (defined(CPU_MCXA275VLH) || defined(CPU_MCXA275VLL) || defined(CPU_MCXA275VLQ) || defined(CPU_MCXA275VPN))
#include "MCXA275_COMMON.h"
#elif (defined(CPU_MCXA276VLH) || defined(CPU_MCXA276VLL) || defined(CPU_MCXA276VLQ) || defined(CPU_MCXA276VPN))
#include "MCXA276_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TDET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TDET_Peripheral_Access_Layer TDET Peripheral Access Layer
 * @{
 */

/** TDET - Size of Registers Arrays */
#define TDET_PGFR_COUNT                           6u

/** TDET - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t CR;                                /**< Control, offset: 0x10 */
  __IO uint32_t SR;                                /**< Status, offset: 0x14 */
  __IO uint32_t LR;                                /**< Lock, offset: 0x18 */
  __IO uint32_t IER;                               /**< Interrupt Enable, offset: 0x1C */
  __IO uint32_t TSR;                               /**< Tamper Seconds, offset: 0x20 */
  __IO uint32_t TER;                               /**< Tamper Enable, offset: 0x24 */
       uint8_t RESERVED_1[4];
  __IO uint32_t PPR;                               /**< Pin Polarity, offset: 0x2C */
       uint8_t RESERVED_2[16];
  __IO uint32_t PGFR[TDET_PGFR_COUNT];             /**< Pin Glitch Filter, array offset: 0x40, array step: 0x4 */
} TDET_Type;

/* ----------------------------------------------------------------------------
   -- TDET Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TDET_Register_Masks TDET Register Masks
 * @{
 */

/*! @name CR - Control */
/*! @{ */

#define TDET_CR_SWR_MASK                         (0x1U)
#define TDET_CR_SWR_SHIFT                        (0U)
/*! SWR - Software Reset
 *  0b0..No effect
 *  0b1..Perform a software reset
 */
#define TDET_CR_SWR(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_CR_SWR_SHIFT)) & TDET_CR_SWR_MASK)

#define TDET_CR_DEN_MASK                         (0x2U)
#define TDET_CR_DEN_SHIFT                        (1U)
/*! DEN - Digital Tamper Enable
 *  0b0..Disables TDET clock and prescaler
 *  0b1..Enables TDET clock and prescaler
 */
#define TDET_CR_DEN(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_CR_DEN_SHIFT)) & TDET_CR_DEN_MASK)

#define TDET_CR_TFSR_MASK                        (0x4U)
#define TDET_CR_TFSR_SHIFT                       (2U)
/*! TFSR - Tamper Force System Reset
 *  0b0..Do not force chip reset
 *  0b1..Force chip reset
 */
#define TDET_CR_TFSR(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_CR_TFSR_SHIFT)) & TDET_CR_TFSR_MASK)

#define TDET_CR_UM_MASK                          (0x8U)
#define TDET_CR_UM_SHIFT                         (3U)
/*! UM - Update Mode
 *  0b0..No effect
 *  0b1..Allows the clearing of interrupts
 */
#define TDET_CR_UM(x)                            (((uint32_t)(((uint32_t)(x)) << TDET_CR_UM_SHIFT)) & TDET_CR_UM_MASK)

#define TDET_CR_DISTAM_MASK                      (0x100U)
#define TDET_CR_DISTAM_SHIFT                     (8U)
/*! DISTAM - Disable Prescaler On Tamper
 *  0b0..No effect
 *  0b1..Automatically disables the prescaler after tamper detection
 */
#define TDET_CR_DISTAM(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_CR_DISTAM_SHIFT)) & TDET_CR_DISTAM_MASK)

