zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_TDET.h
#define TDET_CR_DPR_MASK                         (0xFFFE0000U)
#define TDET_CR_DPR_SHIFT                        (17U)
/*! DPR - Digital Tamper Prescaler */
#define TDET_CR_DPR(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_CR_DPR_SHIFT)) & TDET_CR_DPR_MASK)
/*! @} */

/*! @name SR - Status */
/*! @{ */

#define TDET_SR_DTF_MASK                         (0x1U)
#define TDET_SR_DTF_SHIFT                        (0U)
/*! DTF - Digital Tamper Flag
 *  0b0..TDET tampering not detected
 *  0b1..TDET tampering detected
 */
#define TDET_SR_DTF(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_SR_DTF_SHIFT)) & TDET_SR_DTF_MASK)

#define TDET_SR_TAF_MASK                         (0x2U)
#define TDET_SR_TAF_SHIFT                        (1U)
/*! TAF - Tamper Acknowledge Flag
 *  0b0..Digital Tamper Flag (SR[DTF]) is clear or chip reset has not occurred after Digital Tamper Flag (SR[DTF]) was set.
 *  0b1..Chip reset has occurred after Digital Tamper Flag (SR[DTF]) was set.
 */
#define TDET_SR_TAF(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_SR_TAF_SHIFT)) & TDET_SR_TAF_MASK)

#define TDET_SR_TIF0_MASK                        (0x4U)
#define TDET_SR_TIF0_SHIFT                       (2U)
/*! TIF0 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF0(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF0_SHIFT)) & TDET_SR_TIF0_MASK)

#define TDET_SR_TIF1_MASK                        (0x8U)
#define TDET_SR_TIF1_SHIFT                       (3U)
/*! TIF1 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF1(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF1_SHIFT)) & TDET_SR_TIF1_MASK)

#define TDET_SR_TIF2_MASK                        (0x10U)
#define TDET_SR_TIF2_SHIFT                       (4U)
/*! TIF2 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF2(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF2_SHIFT)) & TDET_SR_TIF2_MASK)

#define TDET_SR_TIF3_MASK                        (0x20U)
#define TDET_SR_TIF3_SHIFT                       (5U)
/*! TIF3 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF3(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF3_SHIFT)) & TDET_SR_TIF3_MASK)

#define TDET_SR_TIF4_MASK                        (0x40U)
#define TDET_SR_TIF4_SHIFT                       (6U)
/*! TIF4 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF4(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF4_SHIFT)) & TDET_SR_TIF4_MASK)

#define TDET_SR_TIF5_MASK                        (0x80U)
#define TDET_SR_TIF5_SHIFT                       (7U)
/*! TIF5 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF5(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF5_SHIFT)) & TDET_SR_TIF5_MASK)

#define TDET_SR_TIF6_MASK                        (0x100U)
#define TDET_SR_TIF6_SHIFT                       (8U)
/*! TIF6 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF6(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF6_SHIFT)) & TDET_SR_TIF6_MASK)

#define TDET_SR_TIF7_MASK                        (0x200U)
#define TDET_SR_TIF7_SHIFT                       (9U)
/*! TIF7 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF7(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF7_SHIFT)) & TDET_SR_TIF7_MASK)

#define TDET_SR_TIF8_MASK                        (0x400U)
#define TDET_SR_TIF8_SHIFT                       (10U)
/*! TIF8 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF8(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF8_SHIFT)) & TDET_SR_TIF8_MASK)

#define TDET_SR_TIF9_MASK                        (0x800U)
#define TDET_SR_TIF9_SHIFT                       (11U)
/*! TIF9 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF9(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF9_SHIFT)) & TDET_SR_TIF9_MASK)

#define TDET_SR_TIF10_MASK                       (0x1000U)
#define TDET_SR_TIF10_SHIFT                      (12U)
/*! TIF10 - Tamper Input n Flag
 *  0b0..On-chip tamper not detected
 *  0b1..On-chip tamper detected
 */
#define TDET_SR_TIF10(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_SR_TIF10_SHIFT)) & TDET_SR_TIF10_MASK)

#define TDET_SR_TPF0_MASK                        (0x10000U)
#define TDET_SR_TPF0_SHIFT                       (16U)
/*! TPF0 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF0(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF0_SHIFT)) & TDET_SR_TPF0_MASK)

#define TDET_SR_TPF1_MASK                        (0x20000U)
#define TDET_SR_TPF1_SHIFT                       (17U)
/*! TPF1 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF1(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF1_SHIFT)) & TDET_SR_TPF1_MASK)

#define TDET_SR_TPF2_MASK                        (0x40000U)
#define TDET_SR_TPF2_SHIFT                       (18U)
/*! TPF2 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF2(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF2_SHIFT)) & TDET_SR_TPF2_MASK)

#define TDET_SR_TPF3_MASK                        (0x80000U)
#define TDET_SR_TPF3_SHIFT                       (19U)
/*! TPF3 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF3(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF3_SHIFT)) & TDET_SR_TPF3_MASK)

#define TDET_SR_TPF4_MASK                        (0x100000U)
#define TDET_SR_TPF4_SHIFT                       (20U)
/*! TPF4 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF4(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF4_SHIFT)) & TDET_SR_TPF4_MASK)

#define TDET_SR_TPF5_MASK                        (0x200000U)
#define TDET_SR_TPF5_SHIFT                       (21U)
/*! TPF5 - Tamper Pin n Flag
 *  0b0..Pin tamper not detected
 *  0b1..Pin tamper detected
 */
#define TDET_SR_TPF5(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_SR_TPF5_SHIFT)) & TDET_SR_TPF5_MASK)
/*! @} */

/*! @name LR - Lock */
/*! @{ */

#define TDET_LR_CRL_MASK                         (0x10U)
#define TDET_LR_CRL_SHIFT                        (4U)
/*! CRL - Control Register Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_CRL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_CRL_SHIFT)) & TDET_LR_CRL_MASK)

#define TDET_LR_SRL_MASK                         (0x20U)
#define TDET_LR_SRL_SHIFT                        (5U)
/*! SRL - Status Register Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_SRL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_SRL_SHIFT)) & TDET_LR_SRL_MASK)

