zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_TDET.h
#define TDET_LR_LRL_MASK                         (0x40U)
#define TDET_LR_LRL_SHIFT                        (6U)
/*! LRL - Lock Register Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_LRL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_LRL_SHIFT)) & TDET_LR_LRL_MASK)

#define TDET_LR_IEL_MASK                         (0x80U)
#define TDET_LR_IEL_SHIFT                        (7U)
/*! IEL - Interrupt Enable Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_IEL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_IEL_SHIFT)) & TDET_LR_IEL_MASK)

#define TDET_LR_TSL_MASK                         (0x100U)
#define TDET_LR_TSL_SHIFT                        (8U)
/*! TSL - Tamper Seconds Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_TSL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_TSL_SHIFT)) & TDET_LR_TSL_MASK)

#define TDET_LR_TEL_MASK                         (0x200U)
#define TDET_LR_TEL_SHIFT                        (9U)
/*! TEL - Tamper Enable Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_TEL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_TEL_SHIFT)) & TDET_LR_TEL_MASK)

#define TDET_LR_PPL_MASK                         (0x800U)
#define TDET_LR_PPL_SHIFT                        (11U)
/*! PPL - Pin Polarity Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_PPL(x)                           (((uint32_t)(((uint32_t)(x)) << TDET_LR_PPL_SHIFT)) & TDET_LR_PPL_MASK)

#define TDET_LR_GFL0_MASK                        (0x10000U)
#define TDET_LR_GFL0_SHIFT                       (16U)
/*! GFL0 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL0(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL0_SHIFT)) & TDET_LR_GFL0_MASK)

#define TDET_LR_GFL1_MASK                        (0x20000U)
#define TDET_LR_GFL1_SHIFT                       (17U)
/*! GFL1 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL1(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL1_SHIFT)) & TDET_LR_GFL1_MASK)

#define TDET_LR_GFL2_MASK                        (0x40000U)
#define TDET_LR_GFL2_SHIFT                       (18U)
/*! GFL2 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL2(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL2_SHIFT)) & TDET_LR_GFL2_MASK)

#define TDET_LR_GFL3_MASK                        (0x80000U)
#define TDET_LR_GFL3_SHIFT                       (19U)
/*! GFL3 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL3(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL3_SHIFT)) & TDET_LR_GFL3_MASK)

#define TDET_LR_GFL4_MASK                        (0x100000U)
#define TDET_LR_GFL4_SHIFT                       (20U)
/*! GFL4 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL4(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL4_SHIFT)) & TDET_LR_GFL4_MASK)

#define TDET_LR_GFL5_MASK                        (0x200000U)
#define TDET_LR_GFL5_SHIFT                       (21U)
/*! GFL5 - Glitch Filter Lock
 *  0b0..Locked and writes are ignored
 *  0b1..Not locked and writes complete as normal
 */
#define TDET_LR_GFL5(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_LR_GFL5_SHIFT)) & TDET_LR_GFL5_MASK)
/*! @} */

/*! @name IER - Interrupt Enable */
/*! @{ */

#define TDET_IER_DTIE_MASK                       (0x1U)
#define TDET_IER_DTIE_SHIFT                      (0U)
/*! DTIE - Digital Tamper Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_DTIE(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_IER_DTIE_SHIFT)) & TDET_IER_DTIE_MASK)

#define TDET_IER_TIIE0_MASK                      (0x4U)
#define TDET_IER_TIIE0_SHIFT                     (2U)
/*! TIIE0 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE0(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE0_SHIFT)) & TDET_IER_TIIE0_MASK)

#define TDET_IER_TIIE1_MASK                      (0x8U)
#define TDET_IER_TIIE1_SHIFT                     (3U)
/*! TIIE1 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE1(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE1_SHIFT)) & TDET_IER_TIIE1_MASK)

#define TDET_IER_TIIE2_MASK                      (0x10U)
#define TDET_IER_TIIE2_SHIFT                     (4U)
/*! TIIE2 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE2(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE2_SHIFT)) & TDET_IER_TIIE2_MASK)

#define TDET_IER_TIIE3_MASK                      (0x20U)
#define TDET_IER_TIIE3_SHIFT                     (5U)
/*! TIIE3 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE3(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE3_SHIFT)) & TDET_IER_TIIE3_MASK)

#define TDET_IER_TIIE4_MASK                      (0x40U)
#define TDET_IER_TIIE4_SHIFT                     (6U)
/*! TIIE4 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE4(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE4_SHIFT)) & TDET_IER_TIIE4_MASK)

#define TDET_IER_TIIE5_MASK                      (0x80U)
#define TDET_IER_TIIE5_SHIFT                     (7U)
/*! TIIE5 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE5(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE5_SHIFT)) & TDET_IER_TIIE5_MASK)

#define TDET_IER_TIIE6_MASK                      (0x100U)
#define TDET_IER_TIIE6_SHIFT                     (8U)
/*! TIIE6 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE6(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE6_SHIFT)) & TDET_IER_TIIE6_MASK)

