zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_TDET.h
#define TDET_IER_TIIE7_MASK                      (0x200U)
#define TDET_IER_TIIE7_SHIFT                     (9U)
/*! TIIE7 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE7(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE7_SHIFT)) & TDET_IER_TIIE7_MASK)

#define TDET_IER_TIIE8_MASK                      (0x400U)
#define TDET_IER_TIIE8_SHIFT                     (10U)
/*! TIIE8 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE8(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE8_SHIFT)) & TDET_IER_TIIE8_MASK)

#define TDET_IER_TIIE9_MASK                      (0x800U)
#define TDET_IER_TIIE9_SHIFT                     (11U)
/*! TIIE9 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE9(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE9_SHIFT)) & TDET_IER_TIIE9_MASK)

#define TDET_IER_TIIE10_MASK                     (0x1000U)
#define TDET_IER_TIIE10_SHIFT                    (12U)
/*! TIIE10 - Tamper Input n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TIIE10(x)                       (((uint32_t)(((uint32_t)(x)) << TDET_IER_TIIE10_SHIFT)) & TDET_IER_TIIE10_MASK)

#define TDET_IER_TPIE0_MASK                      (0x10000U)
#define TDET_IER_TPIE0_SHIFT                     (16U)
/*! TPIE0 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE0(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE0_SHIFT)) & TDET_IER_TPIE0_MASK)

#define TDET_IER_TPIE1_MASK                      (0x20000U)
#define TDET_IER_TPIE1_SHIFT                     (17U)
/*! TPIE1 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE1(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE1_SHIFT)) & TDET_IER_TPIE1_MASK)

#define TDET_IER_TPIE2_MASK                      (0x40000U)
#define TDET_IER_TPIE2_SHIFT                     (18U)
/*! TPIE2 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE2(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE2_SHIFT)) & TDET_IER_TPIE2_MASK)

#define TDET_IER_TPIE3_MASK                      (0x80000U)
#define TDET_IER_TPIE3_SHIFT                     (19U)
/*! TPIE3 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE3(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE3_SHIFT)) & TDET_IER_TPIE3_MASK)

#define TDET_IER_TPIE4_MASK                      (0x100000U)
#define TDET_IER_TPIE4_SHIFT                     (20U)
/*! TPIE4 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE4(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE4_SHIFT)) & TDET_IER_TPIE4_MASK)

#define TDET_IER_TPIE5_MASK                      (0x200000U)
#define TDET_IER_TPIE5_SHIFT                     (21U)
/*! TPIE5 - Tamper Pin n Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_IER_TPIE5(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_IER_TPIE5_SHIFT)) & TDET_IER_TPIE5_MASK)
/*! @} */

/*! @name TSR - Tamper Seconds */
/*! @{ */

#define TDET_TSR_TTS_MASK                        (0xFFFFFFFFU)
#define TDET_TSR_TTS_SHIFT                       (0U)
/*! TTS - Tamper Time Seconds */
#define TDET_TSR_TTS(x)                          (((uint32_t)(((uint32_t)(x)) << TDET_TSR_TTS_SHIFT)) & TDET_TSR_TTS_MASK)
/*! @} */

/*! @name TER - Tamper Enable */
/*! @{ */

#define TDET_TER_TIE0_MASK                       (0x4U)
#define TDET_TER_TIE0_SHIFT                      (2U)
/*! TIE0 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE0(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE0_SHIFT)) & TDET_TER_TIE0_MASK)

#define TDET_TER_TIE1_MASK                       (0x8U)
#define TDET_TER_TIE1_SHIFT                      (3U)
/*! TIE1 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE1(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE1_SHIFT)) & TDET_TER_TIE1_MASK)

#define TDET_TER_TIE2_MASK                       (0x10U)
#define TDET_TER_TIE2_SHIFT                      (4U)
/*! TIE2 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE2(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE2_SHIFT)) & TDET_TER_TIE2_MASK)

#define TDET_TER_TIE3_MASK                       (0x20U)
#define TDET_TER_TIE3_SHIFT                      (5U)
/*! TIE3 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE3(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE3_SHIFT)) & TDET_TER_TIE3_MASK)

#define TDET_TER_TIE4_MASK                       (0x40U)
#define TDET_TER_TIE4_SHIFT                      (6U)
/*! TIE4 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE4(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE4_SHIFT)) & TDET_TER_TIE4_MASK)

#define TDET_TER_TIE5_MASK                       (0x80U)
#define TDET_TER_TIE5_SHIFT                      (7U)
/*! TIE5 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE5(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE5_SHIFT)) & TDET_TER_TIE5_MASK)

#define TDET_TER_TIE6_MASK                       (0x100U)
#define TDET_TER_TIE6_SHIFT                      (8U)
/*! TIE6 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE6(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE6_SHIFT)) & TDET_TER_TIE6_MASK)

#define TDET_TER_TIE7_MASK                       (0x200U)
#define TDET_TER_TIE7_SHIFT                      (9U)
/*! TIE7 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE7(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE7_SHIFT)) & TDET_TER_TIE7_MASK)

#define TDET_TER_TIE8_MASK                       (0x400U)
#define TDET_TER_TIE8_SHIFT                      (10U)
/*! TIE8 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE8(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE8_SHIFT)) & TDET_TER_TIE8_MASK)

