zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_TDET.h
#define TDET_TER_TIE9_MASK                       (0x800U)
#define TDET_TER_TIE9_SHIFT                      (11U)
/*! TIE9 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE9(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE9_SHIFT)) & TDET_TER_TIE9_MASK)

#define TDET_TER_TIE10_MASK                      (0x1000U)
#define TDET_TER_TIE10_SHIFT                     (12U)
/*! TIE10 - Tamper Input Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TIE10(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_TER_TIE10_SHIFT)) & TDET_TER_TIE10_MASK)

#define TDET_TER_TPE0_MASK                       (0x10000U)
#define TDET_TER_TPE0_SHIFT                      (16U)
/*! TPE0 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE0(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE0_SHIFT)) & TDET_TER_TPE0_MASK)

#define TDET_TER_TPE1_MASK                       (0x20000U)
#define TDET_TER_TPE1_SHIFT                      (17U)
/*! TPE1 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE1(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE1_SHIFT)) & TDET_TER_TPE1_MASK)

#define TDET_TER_TPE2_MASK                       (0x40000U)
#define TDET_TER_TPE2_SHIFT                      (18U)
/*! TPE2 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE2(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE2_SHIFT)) & TDET_TER_TPE2_MASK)

#define TDET_TER_TPE3_MASK                       (0x80000U)
#define TDET_TER_TPE3_SHIFT                      (19U)
/*! TPE3 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE3(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE3_SHIFT)) & TDET_TER_TPE3_MASK)

#define TDET_TER_TPE4_MASK                       (0x100000U)
#define TDET_TER_TPE4_SHIFT                      (20U)
/*! TPE4 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE4(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE4_SHIFT)) & TDET_TER_TPE4_MASK)

#define TDET_TER_TPE5_MASK                       (0x200000U)
#define TDET_TER_TPE5_SHIFT                      (21U)
/*! TPE5 - Tamper Pin Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_TER_TPE5(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_TER_TPE5_SHIFT)) & TDET_TER_TPE5_MASK)
/*! @} */

/*! @name PPR - Pin Polarity */
/*! @{ */

#define TDET_PPR_TPP0_MASK                       (0x1U)
#define TDET_PPR_TPP0_SHIFT                      (0U)
/*! TPP0 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP0(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP0_SHIFT)) & TDET_PPR_TPP0_MASK)

#define TDET_PPR_TPP1_MASK                       (0x2U)
#define TDET_PPR_TPP1_SHIFT                      (1U)
/*! TPP1 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP1(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP1_SHIFT)) & TDET_PPR_TPP1_MASK)

#define TDET_PPR_TPP2_MASK                       (0x4U)
#define TDET_PPR_TPP2_SHIFT                      (2U)
/*! TPP2 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP2(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP2_SHIFT)) & TDET_PPR_TPP2_MASK)

#define TDET_PPR_TPP3_MASK                       (0x8U)
#define TDET_PPR_TPP3_SHIFT                      (3U)
/*! TPP3 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP3(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP3_SHIFT)) & TDET_PPR_TPP3_MASK)

#define TDET_PPR_TPP4_MASK                       (0x10U)
#define TDET_PPR_TPP4_SHIFT                      (4U)
/*! TPP4 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP4(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP4_SHIFT)) & TDET_PPR_TPP4_MASK)

#define TDET_PPR_TPP5_MASK                       (0x20U)
#define TDET_PPR_TPP5_SHIFT                      (5U)
/*! TPP5 - Tamper Pin n Polarity
 *  0b0..Not inverted
 *  0b1..Inverted
 */
#define TDET_PPR_TPP5(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPP5_SHIFT)) & TDET_PPR_TPP5_MASK)

#define TDET_PPR_TPID0_MASK                      (0x10000U)
#define TDET_PPR_TPID0_SHIFT                     (16U)
/*! TPID0 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID0(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID0_SHIFT)) & TDET_PPR_TPID0_MASK)

#define TDET_PPR_TPID1_MASK                      (0x20000U)
#define TDET_PPR_TPID1_SHIFT                     (17U)
/*! TPID1 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID1(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID1_SHIFT)) & TDET_PPR_TPID1_MASK)

#define TDET_PPR_TPID2_MASK                      (0x40000U)
#define TDET_PPR_TPID2_SHIFT                     (18U)
/*! TPID2 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID2(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID2_SHIFT)) & TDET_PPR_TPID2_MASK)

#define TDET_PPR_TPID3_MASK                      (0x80000U)
#define TDET_PPR_TPID3_SHIFT                     (19U)
/*! TPID3 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID3(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID3_SHIFT)) & TDET_PPR_TPID3_MASK)

#define TDET_PPR_TPID4_MASK                      (0x100000U)
#define TDET_PPR_TPID4_SHIFT                     (20U)
/*! TPID4 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID4(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID4_SHIFT)) & TDET_PPR_TPID4_MASK)

#define TDET_PPR_TPID5_MASK                      (0x200000U)
#define TDET_PPR_TPID5_SHIFT                     (21U)
/*! TPID5 - Tamper Pin n Input Data
 *  0b0..Zero
 *  0b1..One
 */
#define TDET_PPR_TPID5(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PPR_TPID5_SHIFT)) & TDET_PPR_TPID5_MASK)
/*! @} */

/*! @name PGFR - Pin Glitch Filter */
/*! @{ */

#define TDET_PGFR_GFW_MASK                       (0x3FU)
#define TDET_PGFR_GFW_SHIFT                      (0U)
/*! GFW - Glitch Filter Width */
#define TDET_PGFR_GFW(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_GFW_SHIFT)) & TDET_PGFR_GFW_MASK)

#define TDET_PGFR_GFP_MASK                       (0x40U)
#define TDET_PGFR_GFP_SHIFT                      (6U)
/*! GFP - Glitch Filter Prescaler
 *  0b0..512 Hz prescaler clock
 *  0b1..32.768 kHz clock
 */
#define TDET_PGFR_GFP(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_GFP_SHIFT)) & TDET_PGFR_GFP_MASK)

#define TDET_PGFR_GFE_MASK                       (0x80U)
#define TDET_PGFR_GFE_SHIFT                      (7U)
/*! GFE - Glitch Filter Enable
 *  0b0..Bypasses
 *  0b1..Enables
 */
#define TDET_PGFR_GFE(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_GFE_SHIFT)) & TDET_PGFR_GFE_MASK)

#define TDET_PGFR_TPSW_MASK                      (0x300U)
#define TDET_PGFR_TPSW_SHIFT                     (8U)
/*! TPSW - Tamper Pin Sample Width
 *  0b00..Continuous monitoring, pin sampling disabled
 *  0b01..2 cycles for pull enable and 1 cycle for input buffer enable
 *  0b10..4 cycles for pull enable and 2 cycles for input buffer enable
 *  0b11..8 cycles for pull enable and 4 cycles for input buffer enable
 */
#define TDET_PGFR_TPSW(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPSW_SHIFT)) & TDET_PGFR_TPSW_MASK)

#define TDET_PGFR_TPSF_MASK                      (0xC00U)
#define TDET_PGFR_TPSF_SHIFT                     (10U)
/*! TPSF - Tamper Pin Sample Frequency
 *  0b00..Every 8 cycles
 *  0b01..Every 32 cycles
 *  0b10..Every 128 cycles
 *  0b11..Every 512 cycles
 */
#define TDET_PGFR_TPSF(x)                        (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPSF_SHIFT)) & TDET_PGFR_TPSF_MASK)

#define TDET_PGFR_TPE_MASK                       (0x1000000U)
#define TDET_PGFR_TPE_SHIFT                      (24U)
/*! TPE - Tamper Pull Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_PGFR_TPE(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPE_SHIFT)) & TDET_PGFR_TPE_MASK)

#define TDET_PGFR_TPS_MASK                       (0x2000000U)
#define TDET_PGFR_TPS_SHIFT                      (25U)
/*! TPS - Tamper Pull Select
 *  0b0..Asserts
 *  0b1..Negates
 */
#define TDET_PGFR_TPS(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPS_SHIFT)) & TDET_PGFR_TPS_MASK)

#define TDET_PGFR_TPV_MASK                       (0x4000000U)
#define TDET_PGFR_TPV_SHIFT                      (26U)
/*! TPV - Tamper Pull Value
 *  0b0..Low
 *  0b1..High
 */
#define TDET_PGFR_TPV(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPV_SHIFT)) & TDET_PGFR_TPV_MASK)

#define TDET_PGFR_TPF_MASK                       (0x8000000U)
#define TDET_PGFR_TPF_SHIFT                      (27U)
/*! TPF - Tamper Passive Filter
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_PGFR_TPF(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_TPF_SHIFT)) & TDET_PGFR_TPF_MASK)

#define TDET_PGFR_IBE_MASK                       (0x80000000U)
#define TDET_PGFR_IBE_SHIFT                      (31U)
/*! IBE - Input Buffer Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TDET_PGFR_IBE(x)                         (((uint32_t)(((uint32_t)(x)) << TDET_PGFR_IBE_SHIFT)) & TDET_PGFR_IBE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group TDET_Register_Masks */


/*!
 * @}
 */ /* end of group TDET_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* TDET_H_ */

